<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Jean-Michel Couvreur">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.02 [en] (Win95; I) [Netscape]">
   <TITLE>Plan de d&eacute;veloppement</TITLE>
</HEAD>
<BODY>

<CENTER><FONT SIZE=+4>Plan de d&eacute;veloppement</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<H1>
1- Description g&eacute;n&eacute;rale</H1>
<p align="justify">Le projet que nous avons choisi de d&eacute;velopper est un site de r&eacute;seau social destin&eacute; à tout le monde, principalement au jeune public. L’utilisateur doit en premier temps être inscrit pour être actif sur le site. Le site a pour objectif de prendre en compte l’avis des autres utilisateurs sur un sujet via des photos.<br/><br/>
En effet un utilisateur peut poster une photo avec une description et y d&eacute;finir les critères à noter, ainsi que le public autoris&eacute; à noter. Il a ensuite la possibilit&eacute; de demander le contact à ceux qui le notent. Le compte contact&eacute; ne sera visible que si celui-ci en donne l’autorisation.<br/>
L’utilisateur peut aussi faire une recherche par mot cl&eacute;s pour trouver les photos qui l’int&eacute;ressent et donner une note pour chaque critère des photos entre 0 et 5.<br/>
Par exemple, une jeune fille inscrite sur le site veut sortir en soir&eacute;e, mais ne sais pas quelle tenue mettre. Elle poste donc une photo avec sa robe, ses chaussures, sa coiffure et demande l’avis des autres utilisateurs (amis ou autres) sur les critères qui l'int&eacute;ressent, comme par exemple la couleur de sa robe, des chaussures etc.<br/><br/>
Pour faire connaître notre site nous envisageons dans un premier temps d’utiliser des mots cl&eacute;s pr&eacute;cis lors de la cr&eacute;ation du site dans le code html, ayant pour objectif de faciliter le r&eacute;f&eacute;rencement du site, nous envisageons &eacute;galement de faire des publicit&eacute;s sur d’autres r&eacute;seaux sociaux. A long terme, l’objectif est de synchroniser le site avec d’autres r&eacute;seaux sociaux tels que Facebook, Twitter, Skype…<br/>
Notre projet est original du fait que les autres r&eacute;seaux sociaux ne proposent pas ce type de fonctionnalit&eacute;s, en effet il permet de connaître le degr&eacute; d’appr&eacute;ciation des personnes de manière pr&eacute;cise sur plusieurs aspects d’une photo (coupe de cheveux, couleur d’une voiture….). Ceci permet donc de ne pas se restreindre à l’avis de ses amis de tous les jours et d’avoir un avis plus objectif.<br/>
L’&eacute;quipe sera compos&eacute; comme suit :<br/>
<ul><li>Le chef de projet <strong>M Garik BADEYAN</strong> qui aura comme fonctions, la planification, la d&eacute;finition des tâches, l’organisation des &eacute;quipes de travail et la validation des d&eacute;cisions.</li>
<li>Le responsable qualit&eacute; <strong>M Houssam BENSEGHIR</strong> s’occupe de l’architecture, du g&eacute;nie logiciel et des tests/recettes informatiques.</li>
<li>Responsable d&eacute;veloppement interface <strong>M Ferhat BENAMARA</strong> assurera la conception et la mise en oeuvre des diff&eacute;rentes interfaces du site sous HTML et CSS.</li>
<li>Le responsable de d&eacute;veloppement fonctionnel <strong>M Khayredine BOUNABI</strong> aura comme fonctions la conception et la gestion des bases de donn&eacute;es sous MySQL et le d&eacute;veloppement web sous PHP</li>
<li>Le responsable outils de d&eacute;veloppement <strong>Mlle Blanche COSTE</strong> qui sera l’assistance technique des outils de d&eacute;veloppement WAMP, SVN, GIT, intelliJ.</li>
</ul>
Ce projet sera d&eacute;velopp&eacute; à l’aide du serveur WAMP en utilisant les outils de programmation et de gestion de base de donn&eacute;es HTML, PHP, CSS et MySQL. Le projet sera compos&eacute; au final du site web ainsi que d’un cahier des charges et d’un rapport d’activit&eacute;.<br/><br/>
Le projet sera rendu le ???????????<br/><br/>
Le cours web nous a permis d’apprendre à coder de manière statique sous les outils HTML et CSS et de façon dynamique sous PHP mais aussi de concevoir et g&eacute;rer des bases de donn&eacute;es sous MySQL.<br/>
Le cours de g&eacute;nie logiciel nous a permis de nous familiariser avec les m&eacute;tiers de consultants fonctionnels à travers les diff&eacute;rentes phases par lesquelles passe un projet.<br/>
Les comp&eacute;tences acquises en cours web et g&eacute;nie logiciel ainsi que la motivation du groupe rendent ce projet faisable dans la dur&eacute;e.<br/>
Nous avons pr&eacute;vu de r&eacute;aliser des tests et validation sur le bon fonctionnement du site.<br/></p>

<H1>
2- Documentations</H1>
<ul>
    <li>Cours de G&eacute;nie logiciel de J-M Couvreur</li>
    <li>Cours d'Application Web de ... Bich Dao</li>
    <li><a href="http://www.w3schools.com" target="blank">www.w3schools.com</a> : tutoriels HTML, CSS, PHP</li>
    <li><a href="http://www.openclassrooms.com" target="blank">www.openclassrooms.com</a></li>
</ul>

<H1>3- Ressources</H1>
(Description des ressources humaines et mat&eacute;riels. Donner et d&eacute;finir le r&ocirc;le des intervenants)
<u>Ressources mat&eacute;riels:</u>
<ul>
<li>Google Drive : Partage de documents </li>
<li>[mettre configuration ordi de chacun] </li>
<li>Serveur Free </li>
<li>PowerPoint : conception du prototype papier </li>
<li>Microsoft Word </li>
<li>GanttProject : Diagramme de Gantt pour le planning </li>
<li>WinDeign</li>
</ul>
<u>Ressources humaines:</u><br>
Groupe: (mettre role)
<ul>
    <li>Badeyan Garik : </li>
    <li>Benamara Ferhat : </li>
    <li>Benseghir Houssam : </li>
    <li>Bounabi Khayreddine : </li>
    <li>Coste Blanche : </li>
</ul>
Intervenants:
<ul>
    <li>Monsieur Jean-Michel Couvreur (G&eacute;nie logiciel)</li>
    <li></li>
</ul>

<H1>4- Planning</H1>

Liste des taches et assignation/planification des taches<br><br>
Planning initial, Planning final<br>
MCD,MLD<br>
<br>




<H1>
5- D&eacute;livrables</H1>

Description des d&eacute;livrables (cahier des charges, m&eacute;moire,
manuel utilisateur, pr&eacute;sentation)<br/>[mettre des liens]<br/>
<u>G&eacute;nie logiciel :</u><br/>
    Cahier des charges<br/>
    Rapport d'activit&eacute; :
    <ul>
       <li>Badeyan Garik </li>
       <li>Benamara Ferhat </li>
       <li>Benseghir Houssam </li>
       <li>Bounabi Khayreddine </li>
       <li>Coste Blanche</li>
    </ul>
    <br/>
<u>Applications Web : </u><br/>
    <a href="../pages_site/acceuil.html">site</a>

<HR WIDTH="100%">
<BR><A HREF="acceuil.htm"> Look&Note </A>
</BODY>
</HTML>
